OpenFOAM-6-AP/tutorials/multiphase/compressibleInterDyMFoam/RAS/sloshingTank2D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e6;

boundaryField
{
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    walls
    {
        type            calculated;
        value           $internalField;
    }
}

// ************************************************************************* //
